#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Активен       = Истина;
		Объект.Заморожен     = Ложь;
		Объект.ДатаНачала    = НачалоДня(ТекущаяДата());
		Объект.ДатаОкончания = КонецДня(ДобавитьМесяц(ТекущаяДата(), 1));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ВидАбонементаПриИзменении(Элемент)
	ЗаполнитьПоВидуАбонементаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВидуАбонементаНаСервере()
	Если Объект.ВидАбонемента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ВидАб = Объект.ВидАбонемента.ПолучитьОбъект();
	Объект.ОстатокПосещений  = ВидАб.КоличествоПосещений;
	ДнейДействия             = ВидАб.СрокДействияВДнях - 1;
	Объект.ДатаОкончания     = КонецДня(Объект.ДатаНачала + ДнейДействия * 86400);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеСправочника_АбонементыКлиентов");
КонецПроцедуры

#КонецОбласти
