#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата     = ТекущаяДата();
		Объект.Отменена = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	ЗаполнитьАбонементКлиентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонементКлиентаНаСервере()
	Если Объект.Клиент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	// Найти активный абонемент клиента
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	| АбонементыКлиентов.Ссылка
	|ИЗ
	| Справочник.АбонементыКлиентов КАК АбонементыКлиентов
	|ГДЕ
	| АбонементыКлиентов.Клиент = &Клиент
	| И АбонементыКлиентов.Активен = ИСТИНА
	| И АбонементыКлиентов.ОстатокПосещений > 0
	|УПОРЯДОЧИТЬ ПО
	| АбонементыКлиентов.ДатаОкончания УБЫВ";
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Объект.АбонементКлиента = Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеДокумента_ЗаписьНаЗанятие");
КонецПроцедуры

#КонецОбласти
