#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Активно                = Истина;
		Объект.ПродолжительностьМинут = 60;
		Объект.Вместимость            = 10;
		Объект.ДатаНачала             = НачалоДня(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеСправочника_Занятия");
КонецПроцедуры

#КонецОбласти
