#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Активен             = Истина;
		Объект.СрокДействияВДнях   = 30;
		Объект.КоличествоПосещений = 12;
		Объект.Цена                = 3000;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеСправочника_ВидыАбонементов");
КонецПроцедуры

#КонецОбласти
